{
    "en":[
        {
            "id":0,
            "title":"valleyfield's intercollegiate gameJam",
            "date":"january 2020",
            "software":"UNITY//C#",
            "video":["https://www.youtube-nocookie.com/embed/f8dJNoXbYNk"],
            "artstation":["https://louishorlaville.artstation.com/projects/w6qzk9"],
            "github":[],
            "fieldId":1,
            "fieldName":"VIDEO GAME DEVELOPMENT",
            "collab":[
                "Rebecca Anescar",
                "Radhika Patel",
                "Émile Jutras",
                "Olivier Larose",
                "Allen Jang",
                "Luka Ross",
                "Valera Kuzmenko"
            ],
            "text":[
                "My team and I won second place in our first GameJam ever, which theme's was 'Quebec's Tales and Legends'. We are very proud of what we've been able to accomplish in the little time we had and given the fact that we created all of our assets ourselves.",
                "I was in charge of the character's movements, the interaction of the player with its environment (such as the enemies and the lamp posts), the compass' functionality, and the assets' implementation into Unity. Even though those were my responsibilities, we all helped each other out with every and other tasks, and I think that anybody reading this who participated to a gameJam can say that we never really stick to only one role during those events.",
                "The biggest challenge on this project was to, first, get out of my comfort zone since this was my first gameJam ever, and second the 40h time limit we had. Working under such pressure thaught me a lot of things and really made me grow."
            ]
        },
        {
            "id":1,
            "title":"borderline",
            "date":"fall 2020",
            "software":"UNITY//C#",
            "video":["https://www.youtube-nocookie.com/embed/NFFRQn0owIQ"],
            "artstation":["https://louishorlaville.artstation.com/projects/WKzZN2?album_id=2882884"],
            "github":[],
            "fieldId":1,
            "fieldName":"VIDEO GAME DEVELOPMENT",
            "collab":[
                "Gabriel A.P.",
                "Sandrine Cryans",
                "Diphany Chea"
            ],
            "text":[
                "A pixel 2D JRPG game protoype realised with Unity 3D taking place in a world where your main concern is to save your friends from mental problems such as school anxiety and relationships toxicity.",
                "My role on this project was to implement the overworld’s assets, create and assemble the city (didn't create the assets) where the player starts his journey, and implement the musics for each scene. My responsibilities also  included coding the random props instanciation in the dungeon, such as the lockers, the clocks and the doors,  and coding the functionnality of entering and exiting rooms in the dungeon.",
                "The whole project was developped with a modular structure, making us able to create multiple dungeons very easily after the first one was done. All that was left once the modules have been coded was to create the visual and audio assets and the job was done. This project being my first time working with a modular structure, it was definitely a challenge that I liked working on and that I learned a lot from."
            ]
        },
        {
            "id":2,
            "title":"Stay Cool (work in progress)",
            "date":"automne 2021 - now",
            "software":"Unreal Engine",
            "video":[],
            "artstation":[],
            "github":[],
            "fieldId":1,
            "fieldName":"DÉVELOPPEMENT DE JEUX VIDÉO",
            "collab":[
                "Olivier Larose",
                "Allen Jang",
                "Rebecca Anescar",
                "Émile Jutras",
                "Valera Kuzmenko",
                "Miguel Santana Vargas"
            ],
            "text":[
                "Un prototype de jeu pixel 2D JRPG réalisé avec Unity 3D qui prend place dans un monde ou votre source de préoccupation principale et de venir en aidee à vos amis victimes de problèmes psychologiques tel que l'anxiété scolaire et la toxicité dans les relations sociales.",
                "Mon rôle dans ce projet était d'implémenter les assets créées par l'équipe artistique dans Unity, créer et assembler la ville (je n'ai pas créer les asssets visuelles) dans laquelle le joueur commence son aventure, et implémenter les musique pour chaque scène. Mes responsabilités comprenaient aussi de programmer l'instanciation aléatoire des accessoires dans le donjon, tel que les casiers, les horloges, et les portes, et coder la fonctionnalité d'entrer et sortir des salles dans le donjon.",
                "L'ensemble du projet a été développé avec un structure modulaire, ce qui nous permet de pouvoir créer plusieurs donjons très facilement une fois que les modules du premier donjon étaient programmés. Tout ce qui restait à faire était de créer le matériel visuel et sonor et le travail était quasiment finit. Ce projet étant mon premier projet à base de modules, c'était définitivement un challenge sur lequel j'ai aimé travaillé et duquel j'en ai appris beaucoup."
            ]
        }

    ],
    "fr":[
        {
            "id":0,
            "title":"gameJam intercollégial de valleyfield",
            "date":"janvier 2020",
            "software":"UNITY//C#",
            "video":["https://www.youtube-nocookie.com/embed/f8dJNoXbYNk"],
            "artstation":["https://louishorlaville.artstation.com/projects/w6qzk9?album_id=2882884"],
            "github":[],
            "fieldId":1,
            "fieldName":"DÉVELOPPEMENT DE JEUX VIDÉO",
            "collab":[
                "Rebecca Anescar",
                "Radhika Patel",
                "Émile Jutras",
                "Olivier Larose",
                "Allen Jang",
                "Luka Ross",
                "Valera Kuzmenko"
            ],
            "text":[
                "Mon équipe et moi-même avons gagné la seconde place à notre tout premier gameJam, qui avait pour thème 'Contes et légendes québécoises'. Nous sommes très fier de travail que nous avons réalisé  dans le peu de temps que nous avions (40 heures), et étant donné que nous avons réalisé tout le matériel visuel et sonore nous-même.",
                "J'étais en charge de la programmation des mouvements du personnage, de ses intéractions avec son environnement (tel que les ennemies et les lampadaires), la fonctionnalité du compas, ainsi que l'implémentation des assets visuels et sonor dans Unity. Même si ces dernières étaient mes responsabilités, nous nous sommes tous entraidé ici et là, et je pense que quiconque lisant ceci et ayant participé à un gameJam peut confirmer qu'on ne reste jamais cantonné à un seul et même rôle pendant ces évènnements.",
                "Le plus gros challenge sur ce projet était de, premièrement, sortir de ma zone de confort étant donné que les gameJams étaient quelques chose d'inconnus et que je ne savais pas à quoi m'attendre. Ensuite, il y avait la limite de temps de 40h que nous avions pour réalizer le projet. Travail sous une telle pression m'a très certainement appris beaucoup de choses et m'a fais grandir."
            ]
        },
        {
            "id":1,
            "title":"borderline",
            "date":"automne 2020",
            "software":"UNITY//C#",
            "video":["https://www.youtube-nocookie.com/embed/NFFRQn0owIQ"],
            "artstation":["https://louishorlaville.artstation.com/projects/WKzZN2"],
            "github":[],
            "fieldId":1,
            "fieldName":"DÉVELOPPEMENT DE JEUX VIDÉO",
            "collab":[
                "Gabriel A.P.",
                "Sandrine Cryans",
                "Diphany Chea"
            ],
            "text":[
                "Un prototype de jeu pixel 2D JRPG réalisé avec Unity 3D qui prend place dans un monde ou votre source de préoccupation principale et de venir en aidee à vos amis victimes de problèmes psychologiques tel que l'anxiété scolaire et la toxicité dans les relations sociales.",
                "Mon rôle dans ce projet était d'implémenter les assets créées par l'équipe artistique dans Unity, créer et assembler la ville (je n'ai pas créer les asssets visuelles) dans laquelle le joueur commence son aventure, et implémenter les musique pour chaque scène. Mes responsabilités comprenaient aussi de programmer l'instanciation aléatoire des accessoires dans le donjon, tel que les casiers, les horloges, et les portes, et coder la fonctionnalité d'entrer et sortir des salles dans le donjon.",
                "L'ensemble du projet a été développé avec un structure modulaire, ce qui nous permet de pouvoir créer plusieurs donjons très facilement une fois que les modules du premier donjon étaient programmés. Tout ce qui restait à faire était de créer le matériel visuel et sonor et le travail était quasiment finit. Ce projet étant mon premier projet à base de modules, c'était définitivement un challenge sur lequel j'ai aimé travaillé et duquel j'en ai appris beaucoup."
            ]
        },
        {
            "id":2,
            "title":"Stay Cool (work in progress)",
            "date":"automne 2021 - maintenant",
            "software":"Unreal Engine",
            "video":[],
            "artstation":[],
            "github":[],
            "fieldId":1,
            "fieldName":"DÉVELOPPEMENT DE JEUX VIDÉO",
            "collab":[
                "Olivier Larose",
                "Allen Jang",
                "Rebecca Anescar",
                "Émile Jutras",
                "Valera Kuzmenko",
                "Miguel Santana Vargas"
            ],
            "text":[
                "Jeu 3D puzzle dans lequel vous incarnez un cube de glace qui n'a qu'un seul but: s'échapper de la cuisine afin d'échapper au massacre causé par le stand de limonade d'été.",
                "Ce projet est un jeu sur lequel nous travaillons sur nos temps libre que nous avons commencer par pur plaisir. Les rôles des membres de l'équipes s'entre-mêle au niveau de la conception du jeu, mais ma responsabilité est l'intégration de nouvelles fonctionnalités avec le controlleur du personnage ainsi que l'intégration d'assets visuel et sonores.",
                "Stay Cool est mon tout premier jeu créé à l'aide d'Unreal Engine et du système de blueprints. Le début de l'apprentissage est plutôt lent mais très intéressant. Je me suis rapidement rendu compte de similarités de logique avec un langage du programmation plus 'traditionnel'. Ce fut pour moi l'occasion d'ajouter du contenu à mon baggage de connaissance, mais je compte bien évidemment pousser mon apprentissage et commencer à apprendre le C++."
            ]
        }

    ]
}


