{
    "en":[
        {
            "id":0,
            "title":"Les enfants de la forêt",
            "date":"january 2020",
            "software":"UNITY//C#",
            "video":["https://www.youtube-nocookie.com/embed/f8dJNoXbYNk"],
            "itchio":[],
            "github":[],
            "fieldId":1,
            "fieldName":"VIDEO GAME DEVELOPMENT",
            "collab":[
                "Rebecca Anescar",
                "Radhika Patel",
                "Émile Jutras",
                "Olivier Larose",
                "Allen Jang",
                "Luka Ross",
                "Valera Kuzmenko"
            ],
            "text":[
                "My team and I won second place in our first GameJam ever, which theme's was 'Quebec's Tales and Legends'. We are very proud of what we've been able to accomplish in the little time we had and given the fact that we created all of our assets ourselves.",
                "I was in charge of the character's movements, the interaction of the player with its environment (such as the enemies and the lamp posts), the compass' functionality, and the assets' implementation into Unity. Even though those were my responsibilities, we all helped each other out with every and other tasks, and I think that anybody reading this who participated to a gameJam can say that we never really stick to only one role during those events.",
                "The biggest challenge on this project was to, first, get out of my comfort zone since this was my first gameJam ever, and second the 40h time limit we had. Working under such pressure thaught me a lot of things and really made me grow."
            ]
        },
        {
            "id":1,
            "title":"Borderline",
            "date":"fall 2020",
            "software":"UNITY//C#",
            "video":["https://www.youtube-nocookie.com/embed/NFFRQn0owIQ"],
            "itchio":["https://louishorlaville.itch.io/borderline"],
            "github":[],
            "fieldId":1,
            "fieldName":"VIDEO GAME DEVELOPMENT",
            "collab":[
                "Gabriel A.P.",
                "Sandrine Cryans",
                "Diphany Chea"
            ],
            "text":[
                "A pixel 2D JRPG game protoype realised with Unity 3D taking place in a world where your main concern is to save your friends from mental problems such as school anxiety and relationships toxicity.",
                "My role on this project was to implement the overworld’s assets, create and assemble the city (didn't create the assets) where the player starts his journey, and implement the musics for each scene. My responsibilities also  included coding the random props instanciation in the dungeon, such as the lockers, the clocks and the doors,  and coding the functionnality of entering and exiting rooms in the dungeon.",
                "The whole project was developped with a modular structure, making us able to create multiple dungeons very easily after the first one was done. All that was left once the modules have been coded was to create the visual and audio assets and the job was done. This project being my first time working with a modular structure, it was definitely a challenge that I liked working on and that I learned a lot from."
            ]
        },
        {
            "id":2,
            "title":"Stay Cool (work in progress)",
            "date":"autumn 2021 - now",
            "software":"UNREAL ENGINE",
            "video":[],
            "itchio":[],
            "github":[],
            "fieldId":1,
            "fieldName":"VIDEO GAME DEVELOPMENT",
            "collab":[
                "Olivier Larose",
                "Allen Jang",
                "Rebecca Anescar",
                "Émile Jutras",
                "Valera Kuzmenko",
                "Miguel Santana Vargas"
            ],
            "text":[
                "A 3D puzzle game in which u embody an ice cube who has but only one goal: escape the kitchen along with the chaos massacre created by the lemonade party.",
                "This project is a game which friends and I have been working on on our free time out of pure pleasure of creating something we liked. Every team member touched a bit of everything, but one of my main responsibilities was the implementation of mechanics and fonctionnalities of the character controller, such as pushing cubes. I was also responsible of some level design and assets integration inside Unreal Engine.",
                "Stay Cool is my very first project working on Unreal Engine using the blueprints system. It was my first time using visual programming, it was very interesting. As I started getting more comfortable with the tool, I started noticing obvious similarities with actual programming, which helped me better my understanding and usage of the blueprints. It was good opportunity for be to broaden my range of skills, but I'm already planning on  deepening my Unreal Engine knowledge and start learning C++."
            ]
        },
        {
            "id":3,
            "title":"Cyber-Slime",
            "date":"winter 2022",
            "software":"UNITY//C#",
            "video":["https://www.youtube-nocookie.com/embed/gb1sHa9Lnsc"],
            "itchio":["https://louishorlaville.itch.io/cyber-slime"],
            "github":["https://github.com/louishorlaville/EnterNameHere"],
            "fieldId":1,
            "fieldName":"VIDEO GAME DEVELOPMENT",
            "collab":[
                "Antoine Beauchesne",
                "Éric Piaugeard",
                "Émile Jutras",
                "Pier-Luc Fournier",
                "Tomas Clark Dumoulin",
                "Jesse Serre"
            ],
            "text":[
                "Created for the Montreal Gamejam 2022, two friends and I assembled a team majorly composed of new people we didn't know beforehand. Getting to know new people while working on a project as a team happened to be a very enriching experience. The game we created is a 2D puzzle plateformer aiming to challenge the player on a logical as well as a technical aspect (mechanics).",
                "The gamjam's theme was 'duality'. After a few hours brainstorming together, we decided to go for a duality of shapes and temporalities. Embody Cyber-Slime, a slime who, depsite his own will, became a time traveller who now has the ability to switch between his orginal round slimy shape and a metallic cyborg-ish cube shape.",
                "My role in this project was the creation of all the different mechanics of the character controller, such as bouncing off the walls while using your slime shape, and  sticking to metallic plateforms while in cyborg form. The main challenge on this project was to detect where to factorize the code, so every script would have its own use. Thanks to this logic, we now have reusable code and an optmial structure.",
                "A link to the download page of the game if available on the on the Github repository, for those who want to play the game."
            ]
        },
        {
            "id":4,
            "title":"Verse Invaders",
            "date":"spring 2022",
            "software":"UNITY//C#",
            "video":[],
            "itchio":["https://conjure.itch.io/verse-invaders"],
            "github":[],
            "fieldId":1,
            "fieldName":"VIDEO GAME DEVELOPMENT",
            "collab":[
                "Soulaha Djenabou Baldé",
                "Naomi Catwell",
                "Yann Dupont",
                "Jason Durand",
                "William Gingras",
                "Daniel Sami"
            ],
            "text":[
                "Created for the 20th edition of the CreativeJam organized by PolyGames, some club members at ÉTS and I got together to participate, learn and mostly have fun.",
                "The gamejam's theme was 'multiverse', and the technical challenge was to implement intern economy to our game. Given the theme, we wanted to challenge ourselves to create a dimension swap, while incorporating an optimal gameplay loop.",
                "Our game is a shooter type in which you have to manage 3 different dimensions and use debris left by destroyed invaders to upgrade your cannon.",
                "In this project, I was mainly in charge of the enemy spawner, the enemy behaviors, managing the player attacks throughout the different dimensions, as well as the creation and implementation of the enemy damage particle systems.",
                "One of most interesting technical challenges to take on was the management of the different dimensions and the mouse in order to be able to shoot in only one dimension at the same time, as well as making sure interdimensional ennemies don't interact together. In order to do it, we used camera's culling mask to select which layer to render for each of them. From here on out, the job left was to make sure the instanciated objects have the correct layer,",
                "Un défi technique qui fut très intéressant à relever fut la gestion des différentes dimensions avec la détection de la sourie pour le tire et faire en sorte que les différents ennemis interdimensionnel n'intéragissaient pas ensemble. Pour ce faire, nous avons utilisé les culling mask des caméras afin de sélectionner les différents Layer rendus. À partir de là, le reste du travail consistait à s'assurer que les objets instanciés avec le Layer approprié."
            ]
        }

    ],
    "fr":[
        {
            "id":0,
            "title":"Les enfants de la forêt",
            "date":"janvier 2020",
            "software":"UNITY//C#",
            "video":["https://www.youtube-nocookie.com/embed/f8dJNoXbYNk"],
            "itchio":[],
            "github":[],
            "fieldId":1,
            "fieldName":"DÉVELOPPEMENT DE JEUX VIDÉO",
            "collab":[
                "Rebecca Anescar",
                "Radhika Patel",
                "Émile Jutras",
                "Olivier Larose",
                "Allen Jang",
                "Luka Ross",
                "Valera Kuzmenko"
            ],
            "text":[
                "Mon équipe et moi-même avons gagné la seconde place à notre tout premier gameJam, qui avait pour thème 'Contes et légendes québécoises'. Nous sommes très fier de travail que nous avons réalisé  dans le peu de temps que nous avions (40 heures), et étant donné que nous avons réalisé tout le matériel visuel et sonore nous-même.",
                "J'étais en charge de la programmation des mouvements du personnage, de ses intéractions avec son environnement (tel que les ennemies et les lampadaires), la fonctionnalité du compas, ainsi que l'implémentation des assets visuels et sonor dans Unity. Même si ces dernières étaient mes responsabilités, nous nous sommes tous entraidé ici et là, et je pense que quiconque lisant ceci et ayant participé à un gameJam peut confirmer qu'on ne reste jamais cantonné à un seul et même rôle pendant ces évènnements.",
                "Le plus gros challenge sur ce projet était de, premièrement, sortir de ma zone de confort étant donné que les gameJams étaient quelques chose d'inconnus et que je ne savais pas à quoi m'attendre. Ensuite, il y avait la limite de temps de 40h que nous avions pour réalizer le projet. Travail sous une telle pression m'a très certainement appris beaucoup de choses et m'a fais grandir."
            ]
        },
        {
            "id":1,
            "title":"Borderline",
            "date":"automne 2020",
            "software":"UNITY//C#",
            "video":["https://www.youtube-nocookie.com/embed/NFFRQn0owIQ"],
            "itchio":["https://louishorlaville.itch.io/borderline"],
            "github":[],
            "fieldId":1,
            "fieldName":"DÉVELOPPEMENT DE JEUX VIDÉO",
            "collab":[
                "Gabriel A.P.",
                "Sandrine Cryans",
                "Diphany Chea"
            ],
            "text":[
                "Un prototype de jeu pixel 2D JRPG réalisé avec Unity 3D qui prend place dans un monde ou votre source de préoccupation principale et de venir en aidee à vos amis victimes de problèmes psychologiques tel que l'anxiété scolaire et la toxicité dans les relations sociales.",
                "Mon rôle dans ce projet était d'implémenter les assets créées par l'équipe artistique dans Unity, créer et assembler la ville (je n'ai pas créer les asssets visuelles) dans laquelle le joueur commence son aventure, et implémenter les musique pour chaque scène. Mes responsabilités comprenaient aussi de programmer l'instanciation aléatoire des accessoires dans le donjon, tel que les casiers, les horloges, et les portes, et coder la fonctionnalité d'entrer et sortir des salles dans le donjon.",
                "L'ensemble du projet a été développé avec un structure modulaire, ce qui nous permet de pouvoir créer plusieurs donjons très facilement une fois que les modules du premier donjon étaient programmés. Tout ce qui restait à faire était de créer le matériel visuel et sonor et le travail était quasiment finit. Ce projet étant mon premier projet à base de modules, c'était définitivement un challenge sur lequel j'ai aimé travaillé et duquel j'en ai appris beaucoup."
            ]
        },
        {
            "id":2,
            "title":"Stay Cool (travail en cours)",
            "date":"automne 2021 - maintenant",
            "software":"UNREAL ENGINE",
            "video":[],
            "itchio":[],
            "github":[],
            "fieldId":1,
            "fieldName":"DÉVELOPPEMENT DE JEUX VIDÉO",
            "collab":[
                "Olivier Larose",
                "Allen Jang",
                "Rebecca Anescar",
                "Émile Jutras",
                "Valera Kuzmenko",
                "Miguel Santana Vargas"
            ],
            "text":[
                "Jeu 3D puzzle dans lequel vous incarnez un cube de glace qui n'a qu'un seul but: s'échapper de la cuisine afin d'échapper au massacre causé par le stand de limonade d'été.",
                "Ce projet est un jeu sur lequel nous travaillons sur nos temps libres que nous avons commencé par pur plaisir. Les rôles des membres de l'équipe s'entre-mêlent au niveau de la conception du jeu, mais ma responsabilité est l'intégration de nouvelles fonctionnalités avec le controlleur du personnage ainsi que l'intégration d'assets visuelles et sonores.",
                "Stay Cool est mon tout premier jeu créé à l'aide d'Unreal Engine et du système de blueprints. Le début de l'apprentissage est plutôt lent mais très intéressant. Je me suis rapidement rendu compte de similarités de logique avec un langage du programmation plus 'traditionnel'. Ce fut pour moi l'occasion d'ajouter du contenu à mon baggage de connaissance, mais je compte bien évidemment pousser mon apprentissage et commencer à apprendre le C++."
            ]
        },
        {
            "id":3,
            "title":"Cyber-Slime",
            "date":"hiver 2022",
            "software":"UNITY//C#",
            "video":["https://www.youtube-nocookie.com/embed/gb1sHa9Lnsc"],
            "itchio":["https://louishorlaville.itch.io/cyber-slime"],
            "github":["https://github.com/louishorlaville/EnterNameHere"],
            "fieldId":1,
            "fieldName":"DÉVELOPPEMENT DE JEUX VIDÉO",
            "collab":[
                "Antoine Beauchesne",
                "Éric Piaugeard",
                "Émile Jutras",
                "Pier-Luc Fournier",
                "Tomas Clark Dumoulin",
                "Jesse Serre"
            ],
            "text":[
                "Réalisé dans le cadre du Montreal Gamejam 2022, deux amis et moi avons assemblé une équipe composée majoritairement de personnes que nous ne connaissions pas. Le fait d'apprendre à connaître de nouvelles personnes tout en travaillant sur un projet commun s'est trouvé être un exercice très enrichissant. Le jeu est un puzzle plateformer 2D visant à défier le joueur autant au niveau logique que technique.",
                "Le thème du gamejam était la dualité. Suite à quelques heures de remue-méninge, nous avons décidé de nous embarquer dans une dualité de formes et de temporalités. Incarnez Cyber-Slime, un slime qui s'est vu, contre son grès, devenir un voyageur temporel et qui a désormais la possibilité d'alterner entre sa forme ronde de slime et celle d'un cube metallique.",
                "Mon rôle dans ce projet était la création du character controller ainsi que toutes les mécaniques qui viennent avec son changement de forme, tel que le rebond sur les murs, et les surfaces magnétiques. Le défi principal était de savoir à quels endroits factoriser le code, afin de concevoir une implémentation optimale réutilisable.",
                "Un lien vers la page de téléchargement est disponible sur le dépôt Github du projet pour ceux qui voudraient essayer le jeu."
            ]
        },
        {
            "id":4,
            "title":"Verse Invaders",
            "date":"printemps 2022",
            "software":"UNITY//C#",
            "video":[],
            "itchio":["https://conjure.itch.io/verse-invaders"],
            "github":[],
            "fieldId":1,
            "fieldName":"DÉVELOPPEMENT DE JEUX VIDÉO",
            "collab":[
                "Soulaha Djenabou Baldé",
                "Naomi Catwell",
                "Yann Dupont",
                "Jason Durand",
                "William Gingras",
                "Daniel Sami"
            ],
            "text":[
                "Réalisé dans le cadre de la 20e édition du CreativeJam organisé par PolyGames, des membres de mon club de l'ÉTS et moi-même nous sommes réunis afin de participer, d'apprendre et de s'amuser.",
                "Le thème du gamejam était le multivers et le défi technique était de posséder une économie interne au jeu. Nous avons voulu relever le défi de créer une transition entre plusieurs dimensions, tout en y incorporant une boucle de jouabilité optimale.",
                "Le jeu est un shooter, dans lequel vous devez gérer vos 3 différentes dimensions et utiliser les débris laissés par les envahisseurs pour améliorer votre cannon.",
                "Lors de ce projet, j'étais principalement en charge de la gestion des ennemis semi-aléatoires, des attaques du joueur et des ennemis à travers les differentes dimensions, ainsi la création et la gestion des systèmes de particules des attaques.",
                "Un défi technique qui fut très intéressant à relever fut la gestion des différentes dimensions avec la détection de la sourie pour le tire et faire en sorte que les différents ennemis interdimensionnel n'intéragissaient pas ensemble. Pour ce faire, nous avons utilisé les culling mask des caméras afin de sélectionner les différents Layer rendus. À partir de là, le reste du travail consistait à s'assurer que les objets instanciés avaient le Layer approprié."
            ]
        }

    ]
}


